// @unit-test
Процедура ПроверитьРаботуИсключения(Фреймворк) Экспорт
	
	Результат = ФункцияКоторуюНужноПротестировать();
	Если Не Результат Тогда
		ВызватьИсключение "Результат отрицательный.";
	КонецЕсли;
	
КонецПроцедуры

// @unit-test
Процедура ПроверитьДобавитьОшибкуСценария(Фреймворк) Экспорт
	
	Результат = ФункцияКоторуюНужноПротестировать();
	Если Не Результат Тогда
		Фреймворк.ДобавитьОшибкуСценария("Результат отрицательный.");
	КонецЕсли;
	
КонецПроцедуры

Функция ФункцияКоторуюНужноПротестировать()
	
	Возврат Ложь;
	
КонецФункции