// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПроверитьПокрытие(Фреймворк) Экспорт

	Для Номер = 1 По 2 Цикл
		Если Номер = 1 Тогда
			А = 1;
			
		ИначеЕсли Номер = 2 Тогда
			А = 2;
				
		ИначеЕсли Номер = 4 Тогда
			А = 4;
				
		Иначе
			А = 3;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Номер = 1 По 3 Цикл
		Если Номер = 1 Тогда
			А = 1;
			
		ИначеЕсли Номер = 2 Тогда
			А = 2;
				
		ИначеЕсли Номер = 4 Тогда
			А = 4;
				
		Иначе
			А = 3;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Истина Тогда
		А = 1;
	КонецЕсли;
	
	Если Ложь Тогда
		А = 1;
	КонецЕсли;
	
	Попытка
		А = Число("А");
		
	Исключение
		А = 2;
		
	КонецПопытки;

	А = 1;

КонецПроцедуры