// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
// @unit-test:success
Процедура ПроверитьВыполнилосьНаИстину(Фреймворк) Экспорт
	Алгоритм	= "ПроверитьИстину(Истина, ""Результат Истина."")";
	
	Фреймворк.ПроверитьВыполнилось(Алгоритм, Неопределено,
		"Результат Истина.");
КонецПроцедуры

// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
// @unit-test:success
Процедура ПроверитьНеВыполнилосьНаИстину(Фреймворк) Экспорт
	Алгоритм	= "ПроверитьЛожь(Истина, ""Результат Ложь."")";
	
	Фреймворк.ПроверитьНеВыполнилось(Алгоритм, Неопределено,
		"Результат Ложь.");
КонецПроцедуры

// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
// @unit-test:success
Процедура ПроверитьМетодВыполнилсяНаИстина(Фреймворк) Экспорт
	ИмяМетода	= "ПроверитьИстину";
	Параметры	= Новый Массив;
	Параметры.Добавить("Истина");
	
	Фреймворк.ПроверитьМетодВыполнился(Фреймворк, ИмяМетода, Параметры,
		"Метод выполнился.");
КонецПроцедуры

// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
// @unit-test:success
Процедура ПроверитьМетодНеВыполнилсяНаИстина(Фреймворк) Экспорт
	ИмяМетода	= "ПроверитьЛожь";
	Параметры	= Новый Массив;
	Параметры.Добавить("Истина");
	
	ТекстОшибки = 
		"Переданный параметр (Истина) не является Ложью, а хотели, чтобы являлся.";
	Фреймворк.ПроверитьМетодНеВыполнился(Фреймворк, ИмяМетода, Параметры, ТекстОшибки);
КонецПроцедуры
